[BalanceDefs.BD_DefendSlabTower_Beacon1 InteractiveObjectBalanceDefinition]
DefaultDisplayName="Lighthouse 1"
Grades[0]=(GradeModifiers=(DisplayName="do 1"))

[BalanceDefs.BD_DefendSlabTower_Beacon2 InteractiveObjectBalanceDefinition]
DefaultDisplayName="house fire 2"
Grades[0]=(GradeModifiers=(DisplayName="bulb 2"))

[BalanceDefs.BD_DefendSlabTower_Beacon3 InteractiveObjectBalanceDefinition]
DefaultDisplayName="Light 3"
Grades[0]=(GradeModifiers=(DisplayName="3 lights"))

[BalanceDefs.BD_DefendSlabTower_BeaconPickUp1 InteractiveObjectBalanceDefinition]
DefaultDisplayName="Fresh pork"
Grades[0]=(GradeModifiers=(DisplayName="Go to the liquor store"))

[BalanceDefs.BD_DefendSlabTower_SupplyCrate InteractiveObjectBalanceDefinition]
DefaultDisplayName="Hyperion's stockpile"
Grades[0]=(GradeModifiers=(DisplayName="hyperion supply tank"))

[DefendSlabTower_Beacon1 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[DefendSlabTower_Beacon1PickUp InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[DefendSlabTower_Beacon2 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[DefendSlabTower_Beacon3 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[DefendSlabTower_Beacon4 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[DefendSlabTower_Beacon5 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.MO_DefendSlabTower_SupplyCrate InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_DefendSlabTower_Beacon MissionItemDefinition]
UseFailureCharacterMessage="you are mine %s about this."
ItemName="Lighthouse"
PickupMessage="they have it %s"
UseFailureLevelMessage="You must be at least %d level to use this item."
UseFailureConstraintsMessage="You cannot use this number."
NoManufacturerName="According to the law"

[ItemDefs.ID_DefendSlabTower_Beacon:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Kamala is a wine called Tajos Galu.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_DefendSlabTower_SlabBeaconPickup MissionItemDefinition]
UseFailureCharacterMessage="And you %s To use this item.."
ItemName="Tajo Lighthouse"
PickupMessage="requested %s"
UseFailureLevelMessage="This item requires at least %d level to use."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="sexual"

[ItemDefs.ID_DefendSlabTower_SlabBeaconPickup:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Torch Pirate's name is Dajos."
NoConstraintText=""
Suffix=""
Prefix=""

